Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# GitRemote
source: Remote
zh_hans: 远程
zh_hant: 遠端

# GitScpTooltip
source: Stage/Commit/Push
zh_hans: 阶段/提交/推送
zh_hant: 階段/提交/推送

# GitPullSuccessTitle
source: Git Pull
zh_hans: Git 拉
zh_hant: Git 拉

# GitPullSuccessMessage
source: Pull completed.
ja_jp: Pull が完了しました。
zh_hans: 拉取完成。
zh_hant: 拉取完成。

# GitPullFailureTitle
source: Git Pull Failed
ja_jp: Git Pull 失敗
zh_hans: Git 拉取失败
zh_hant: Git 拉取失敗

# GitPullFailureMessage
source: Pull failed. Check the remote repository, authentication, or conflict state.
ja_jp: Pull に失敗しました。リモートリポジトリ、認証、または競合状態を確認してください。
zh_hans: 拉取失败。检查远程存储库、身份验证或冲突状态。
zh_hant: 拉取失敗。檢查遠端儲存庫、身份驗證或衝突狀態。

# GitRebaseSuccessTitle
source: Git Rebase
zh_hans: Git 重新基准
zh_hant: Git 重新基準

# GitRebaseSuccessMessage
source: Rebase completed.
ja_jp: Rebase が完了しました。
zh_hans: 变基完成。
zh_hant: 變基完成。

# GitRebaseFailureTitle
source: Git Rebase Failed
ja_jp: Git Rebase 失敗
zh_hans: Git 变基失败
zh_hant: Git 變基失敗

# GitRebaseFailureMessage
source: Rebase failed. Check the remote repository, authentication, or conflict state.
ja_jp: Rebase に失敗しました。リモートリポジトリ、認証、または競合状態を確認してください。
zh_hans: 变基失败。检查远程存储库、身份验证或冲突状态。
zh_hant: 變基失敗。檢查遠端儲存庫、身份驗證或衝突狀態。

# GitCheckoutFailureTitle
source: Git Branch Switch Failed
ja_jp: Git ブランチ切り替え失敗
zh_hans: Git 分支切换失败
zh_hant: Git 分支切換失敗

# GitCheckoutFailureMessage
source: Branch switch failed. Check for uncommitted changes or conflict state.
ja_jp: ブランチの切り替えに失敗しました。未コミットの変更や競合状態を確認してください。
zh_hans: 分支切换失败。请检查未提交的更改或冲突状态。
zh_hant: 分支切換失敗。請檢查未提交的變更或衝突狀態。

# GitRemoteDialogTitle
source: Git Remote
zh_hans: Git 远程
zh_hant: Git 遠程

# GitRemoteDialogLabel
source: origin remote URL
zh_hans: 原点远程 URL
zh_hant: 原點遠端 URL

# GitRemoteDialogConnect
source: Connect
ja_jp: 接続
zh_hans: 连接
zh_hant: 連接

# GitRemoteDialogCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# GitRemoteNoRepoMessage
source: Select or create a Git repository first.
ja_jp: 先に Git リポジトリを選択または作成してください。
zh_hans: 首先选择或创建 Git 存储库。
zh_hant: 首先選擇或建立 Git 儲存庫。

# GitRemoteInvalidUrlMessage
source: Enter a valid GitHub remote URL.
ja_jp: 有効な GitHub remote URL を入力してください。
zh_hans: Enter 有效的 GitHub 远程 URL。
zh_hant: Enter 有效的 GitHub 遠端 URL。

# GitRemoteSuccessMessage
source: The origin remote has been connected.
ja_jp: origin remote を接続しました。
zh_hans: 原点遥控器已连接。
zh_hant: 原點遙控器已連接。

# GitRemoteFailureTitle
source: Git Remote Failed
ja_jp: Git Remote 失敗
zh_hans: Git 远程失败
zh_hant: Git 遠端失敗

# GitRemoteFailureMessage
source: Failed to connect the remote URL.
ja_jp: remote URL の接続に失敗しました。
zh_hans: 连接远程 URL 失败。
zh_hant: 連線遠端 URL 失敗。

# GitRefresh
source: Refresh
ja_jp: 更新
zh_hans: 刷新
zh_hant: 重新整理

# GitHistory
source: History
ja_jp: 履歴
zh_hans: 历史
zh_hant: 歷史

# GitRestoreFile
source: Restore File
ja_jp: ファイル復元
zh_hans: 恢复文件
zh_hant: 恢復文件

# GitRestoreFileDialogTitle
source: Git Restore File
ja_jp: Git ファイル復元
zh_hans: Git 恢复文件
zh_hant: Git 恢復文件

# GitRestoreFileDialogContentFormat
source: Are you sure you want to restore changes in {0}? Untracked files will be deleted.
ja_jp: {0} の変更を復元します。追跡されていないファイル（Untracked）は削除されます。
zh_hans: 您确定要恢复 {0} 中的更改吗？未跟踪的文件将被删除。
zh_hant: 您確定要恢復 {0} 中的變更嗎？未追蹤的檔案將被刪除。

# GitRestoreFileDialogConfirm
source: Restore
ja_jp: 復元
zh_hans: 恢复
zh_hant: 恢復

# GitRestoreFileDialogCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# GitRestoreFailureTitle
source: Git Restore Failed
ja_jp: Git 復元失敗
zh_hans: Git 恢复失败
zh_hant: Git 恢復失敗

# GitRestoreFileFailureMessage
source: Failed to restore the file.
ja_jp: ファイルの復元処理に失敗しました。
zh_hans: 无法恢复文件。
zh_hant: 無法恢復檔案。

# GitRestoreAllDialogTitle
source: Git Restore All
ja_jp: Git すべて復元
zh_hans: Git 全部恢复
zh_hant: Git 全部恢復

# GitRestoreAllDialogContent
source: Are you sure you want to restore all changes? Untracked files will be deleted.
ja_jp: すべての変更を復元します。追跡されていないファイル（Untracked）は削除されます。
zh_hans: 您确定要恢复所有更改吗？未跟踪的文件将被删除。
zh_hant: 您確定要恢復所有變更嗎？未追蹤的檔案將被刪除。

# GitRestoreAllDialogConfirm
source: Restore All
ja_jp: すべて復元
zh_hans: 全部恢复
zh_hant: 全部恢復

# GitRestoreAllFailureMessage
source: Failed to restore all changes.
ja_jp: すべての復元処理に失敗しました。
zh_hans: 无法恢复所有更改。
zh_hant: 無法恢復所有變更。

# ExplorerUpTooltip
source: Parent Folder
ja_jp: 親フォルダ
zh_hans: 父文件夹
zh_hant: 父資料夾

# ExplorerSelectFolder
source: Select Folder...
ja_jp: フォルダ選択...
zh_hans: 选择文件夹...
zh_hant: 選擇資料夾...

# ExplorerOpenTerminalTooltip
source: Open Terminal Here
ja_jp: このフォルダでターミナルを開く
zh_hans: 在这里打开终端
zh_hant: 在這裡打開終端

# ExplorerOpenInWindowsTooltip
source: Open in Windows Explorer
ja_jp: Windows エクスプローラーで開く
zh_hans: 在 Windows 资源管理器中打开
zh_hant: 在 Windows 資源管理器中開啟

# ExplorerAddToFavorites
source: Add to Favorites
ja_jp: お気に入りに追加
zh_hans: 添加到收藏夹
zh_hant: 加入收藏夾

# ExplorerAddFolderToFavorites
source: Add Folder to Favorites
ja_jp: フォルダをお気に入りに追加
zh_hans: 将文件夹添加到收藏夹
zh_hant: 將資料夾新增至收藏夾

# FavoritesFileTab
source: Files
ja_jp: ファイル
zh_hans: 文件
zh_hant: 文件

# FavoritesFolderTab
source: Folders
ja_jp: フォルダ
zh_hans: 文件夹
zh_hant: 資料夾

# RecentFileTab
source: Files
ja_jp: ファイル
zh_hans: 文件
zh_hant: 檔案

# RecentFolderTab
source: Folders
ja_jp: フォルダ
zh_hans: 文件夹
zh_hant: 資料夾

# FavoritesPinTooltip
source: Pin
ja_jp: 固定
zh_hans: 销
zh_hant: 插銷

# GitCreateRepo
source: Init Repo
ja_jp: Git作成
zh_hans: 初始化存储库
zh_hant: 初始化儲存庫

# GitCreateRepoTooltip
source: Initialize Git Repository
ja_jp: Gitリポジトリを作成
zh_hans: 初始化 Git 存储库
zh_hant: 初始化 Git 儲存庫

source: Git: Not Detected
ja_jp: Git: 検出されていません
zh_hans: Git：未检测到
zh_hant: Git：未偵測到

# TerminalTitle
source: Terminal
ja_jp: ターミナル
zh_hans: 终端
zh_hant: 終端

source: New Terminal
ja_jp: 新規ターミナル
zh_hans: 新航站楼
zh_hant: 新航廈

# CloseTerminal
source: Close
ja_jp: 閉じる
zh_hans: 关闭
zh_hant: 關閉

# TerminalPrompt
source: Type command and press Enter
ja_jp: コマンドを入力してEnter
zh_hans: 输入命令并按 Enter
zh_hant: 輸入指令並按 Enter

# SettingsToolbarCustomize
source: Button Display
ja_jp: ボタン表示設定
zh_hans: 按钮显示
zh_hant: 按鈕顯示

# SettingsToolbarButtonVisibility
source: Show/Hide Toolbar Buttons
ja_jp: ツールバーボタンの表示/非表示
zh_hans: 显示/隐藏工具栏按钮
zh_hant: 顯示/隱藏工具列按鈕

# SettingsToolbarDragHint
source: Drag within the left/right lists to reorder buttons, then use the middle buttons to move the selected button between alignments. The Settings button is fixed.
ja_jp: 左/右の一覧内でドラッグして順序を変更し、中央のボタンで選択したボタンの配置を移動できます。設定ボタンは固定です。
zh_hans: 在左/右列表中拖动以重新排序按钮，然后使用中间按钮在对齐方式之间移动所选按钮。设置按钮是固定的。
zh_hant: 在左/右清單中拖曳以重新排序按鈕，然後使用中間按鈕在對齊方式之間移動所選按鈕。設定按鈕是固定的。

# SettingsToolbarLeftAligned
source: Left Aligned
ja_jp: 左揃え
zh_hans: 左对齐
zh_hant: 左對齊

# SettingsToolbarRightAligned
source: Right Aligned
ja_jp: 右揃え
zh_hans: 右对齐
zh_hant: 右對齊

# SettingsToolbarSettingsPinned
source: The Settings button is always shown.
ja_jp: 設定ボタンは常に表示されます。
zh_hans: 设置按钮始终显示。
zh_hant: 設定按鈕始終顯示。

# SettingsToolbarCustomization
source: Toolbar
ja_jp: ツールバー
zh_hans: 工具栏
zh_hant: 工具列

# SettingsToolbarReset
source: Reset Toolbar
ja_jp: ツールバーの初期化
zh_hans: 重置工具栏
zh_hant: 重置工具列

# StatusRightPanelTooltip
source: Right Panel
ja_jp: 右パネル
zh_hans: 右面板
zh_hant: 右面板

# StatusColumnLabel
source: Col
ja_jp: 列
zh_hans: 上校
zh_hant: 上校

# StatusLeftPanelTooltip
source: Left Panel
ja_jp: 左パネル
zh_hans: 左面板
zh_hant: 左側面板

# StatusLineEndingTooltip
source: Click to change line ending
ja_jp: クリックして改行コードを変更
zh_hans: 单击以更改行结尾
zh_hant: 點擊以更改行結尾

# StatusGoToLineTooltip
source: Click to go to line
ja_jp: クリックして行へ移動
zh_hans: 点击前往线路
zh_hant: 點擊前往線路

# StatusGoToOffsetTooltip
source: Click to go to offset
ja_jp: クリックしてオフセットへ移動
zh_hans: 单击以转到偏移
zh_hant: 點擊以移至偏移

# StatusFileSizeFormat
source: Size: {0:N0} bytes
ja_jp: サイズ: {0:N0} bytes
zh_hans: 大小：{0:N0} 字节
zh_hant: 大小：{0:N0} 位元組

# StatusImageFileStatsFormat
source: Size: {0:N0} bytes / {1:N0} x {2:N0} px
ja_jp: サイズ: {0:N0} bytes / {1:N0} x {2:N0} px
zh_hans: 大小：{0:N0} 字节 / {1:N0} x {2:N0} px
zh_hant: 大小：{0:N0} 位元組 / {1:N0} x {2:N0} px

# StatusLineLabel
source: Ln
ja_jp: 行
zh_hans: 熔点
zh_hant: 熔點

# StatusHexOffsetLabel
source: Offset
ja_jp: オフセット
zh_hans: 偏移
zh_hant: 偏移

# StatusHexSelectionFormat
source: Selected: Offset {0} - {1} / Length {2:N0} bytes
ja_jp: 選択: Offset {0} - {1} / 長さ {2:N0} bytes
zh_hans: 已选择：Offset {0} - {1} / 长度 {2:N0} bytes
zh_hant: 已選取：Offset {0} - {1} / 長度 {2:N0} bytes

# StatusEncodingTooltip
source: Select file encoding
ja_jp: ファイルエンコーディングを選択
zh_hans: 选择文件编码
zh_hant: 選擇文件編碼

# StatusLanguageTooltip
source: Change file type
ja_jp: ファイルの種類を変更
zh_hans: 更改文件类型
zh_hant: 變更檔案類型

# StatusImageViewer
source: Image
ja_jp: 画像
zh_hans: 图片
zh_hant: 圖片

# StatusMediaViewer
source: Media
ja_jp: メディア
zh_hans: 媒体
zh_hant: 媒體

# GoToOffsetTitle
source: Go to Offset
ja_jp: オフセットへ移動
zh_hans: 转到偏移
zh_hant: 移至偏移

# GoToOffsetPlaceholder
source: Enter offset...
ja_jp: 移動先 offset を入力...
zh_hans: 输入 offset...
zh_hant: 輸入 offset...

# EncodingChangeTitle
source: Encoding Change
ja_jp: エンコーディング変更
zh_hans: 编码变化
zh_hant: 編碼變化

# EncodingChangeContentFormat
source: Change the encoding of the currently open file to '{0}'? - Convert: Keep the current text and convert the file encoding format. - Reopen: Reload the saved file with this encoding.{1}
ja_jp: 現在開いているファイルのエンコーディングを '{0}' に変更しますか？ - 変換: 現在編集中のテキストを維持し、ファイルのエンコーディング形式を変換して保存します。 - 再読み込み: 保存されているファイルをこのエンコーディングで再読み込みします。{1}
zh_hans: 将当前打开文件的编码更改为“{0}”？ - 转换：保留当前文本并转换文件编码格式。 - 重新打开：使用此编码重新加载保存的文件。{1}
zh_hant: 將目前開啟檔案的編碼更改為“{0}”？ - 轉換：保留目前文字並轉換文件編碼格式。 - 重新開啟：使用此編碼重新載入已儲存的檔案。 {1}

# EncodingChangeConvert
source: Convert
ja_jp: 変換
zh_hans: 转换
zh_hant: 轉換

# EncodingChangeReopen
source: Reopen
ja_jp: 再読み込み
zh_hans: 重新开放
zh_hant: 重新開放

# EncodingChangeCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# EncodingChangeDirtyWarning
source: (Note: Choosing 'Reopen' will lose unsaved changes!)
ja_jp: (注意: '再読み込み' を選択すると保存していない変更は失われます!)
zh_hans: （注意：选择“重新打开”将丢失未保存的更改！）
zh_hant: （注意：選擇「重新開啟」將遺失未儲存的變更！）

# LineEndingChangeTitle
source: Line Ending Change
ja_jp: 改行コード変更
zh_hans: 行尾变化
zh_hant: 行尾變化

# LineEndingChangeContentFormat
source: Convert the line ending of the currently open file to '{0}'?
ja_jp: 現在開いているファイルの改行コードを '{0}' に変換しますか？
zh_hans: 将当前打开文件的行结尾转换为“{0}”？
zh_hant: 將目前開啟檔案的行結尾轉換為“{0}”？

# LineEndingChangeConvert
source: Convert
ja_jp: 変換
zh_hans: 转换
zh_hant: 轉換

# LineEndingChangeCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# LivePreviewTabHeader
source: Preview
ja_jp: プレビュー
zh_hans: 预览
zh_hant: 預覽

# AiAssistantTabHeader
source: AI Assistant
ja_jp: AI アシスタント
zh_hans: AI 助手
zh_hant: AI 助手

# ComboItemHtml
source: HTML Preview
ja_jp: HTMLプレビュー
zh_hans: HTML 预览
zh_hant: HTML 預覽

# ComboItemLatex
source: LaTeX Block
zh_hans: LaTeX 块
zh_hant: LaTeX 塊

# OpenInBrowserButtonText
source: Browser
ja_jp: ブラウザ
zh_hans: 浏览器
zh_hant: 瀏覽器

# OpenInBrowserTooltip
source: Open HTML preview in browser
ja_jp: HTMLプレビューをブラウザで開く
zh_hans: 在浏览器中打开 HTML 预览
zh_hant: 在瀏覽器中開啟 HTML 預覽

# LlmOutputPlaceholder
source: Waiting... Select a range in the editor, then use the AI tools below.
ja_jp: 待機中... エディタで範囲を選択し、下部のAI分析ツールを使用してください。
zh_hans: 等待中... 在编辑器中选择范围，然后使用下方 AI 工具。
zh_hant: 等待中... 在編輯器中選取範圍，然後使用下方 AI 工具。

# SelectionStatsPlaceholder
source: Selection: None (Use file addition for whole file)
ja_jp: 選択範囲: なし (ファイル全体の場合はファイル追加を使用)
zh_hans: 选择：无（整份文件请使用添加文件）
zh_hant: 選取：無（整份檔案請使用新增檔案）

# LlmFileContextPlaceholder
source: No file context
ja_jp: ファイルのコンテキストなし
zh_hans: 无文件上下文
zh_hant: 無檔案上下文

# LlmAddFileContextButtonText
source: Add File Context
ja_jp: ファイル追加
zh_hans: 添加文件上下文
zh_hant: 新增檔案上下文

# LlmRemoveFileContextButtonText
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# LlmExplainButtonText
source: Explain
ja_jp: 解説
zh_hans: 说明
zh_hant: 說明

# LlmSummarizeButtonText
source: Summarize
ja_jp: 要約
zh_hans: 总结
zh_hant: 總結

# LlmTranslateButtonText
source: Translate
ja_jp: 翻訳
zh_hans: 翻译
zh_hant: 翻譯

# LlmImproveButtonText
source: Improve
ja_jp: 改善
zh_hans: 改进
zh_hant: 改進

# LlmCustomPromptPlaceholder
source: Enter questions or custom instructions...
ja_jp: 質問やカスタム指示を入力...
zh_hans: 输入问题或自定义指令...
zh_hant: 輸入問題或自訂指令...

# LlmCustomRunButtonText
source: Send
ja_jp: 送信
zh_hans: 发送
zh_hant: 傳送

# LlmCustomCancelButtonText
source: Cancel
ja_jp: 中断
zh_hans: 取消
zh_hant: 取消

# LlmChunkProgressFormat
source: {0} in progress: {1}/{2} chunks...
ja_jp: {0} 進行中: {1}/{2} チャンク進行中...
zh_hans: {0} 正在进行中：{1}/{2} 块...
zh_hant: {0} 正在進行中：{1}/{2} 區塊...

# LlmFileContextDisplayFormat
source: {0} · Approx. {1:N0} tokens
ja_jp: {0} · 約 {1:N0} トークン
zh_hans: {0} · 大约。 {1:N0} 代币
zh_hant: {0} · 約。 {1:N0} 代幣

# LlmOperationCanceled
source: Operation canceled.
ja_jp: 操作が中断されました。
zh_hans: 操作已取消。
zh_hant: 操作已取消。

# LlmInsertOutputButtonText
source: Insert
ja_jp: 入力
zh_hans: 插入
zh_hant: 插入

# LlmInsertOutputTooltip
source: Insert AI response at current cursor (Selected part only, if selected)
ja_jp: AIの応答を現在のカーソルに入力 (選択された場合は選択部分のみ)
zh_hans: 在当前光标处插入 AI 响应（仅限所选部分，如果选择）
zh_hant: 在目前遊標處插入 AI 響應（僅限所選部分，如果選擇）

# LlmErrorTitle
source: AI Error
ja_jp: AI エラー
zh_hans: 人工智能错误
zh_hant: 人工智慧錯誤

# LlmNoSelectionExplain
source: No text selected. Please select a range in the editor to analyze and try again.
ja_jp: 選択されたテキストがありません。エディタで分析する範囲を選択してから実行してください。
zh_hans: 未选择任何文本。请在编辑器中选择一个范围进行分析，然后重试。
zh_hant: 未選擇任何文字。請在編輯器中選擇範圍進行分析，然後重試。

# LlmNoSelectionSummarize
source: No text selected. Please select a range to summarize.
ja_jp: 選択されたテキストがありません。要約する範囲を選択してください。
zh_hans: 未选择任何文本。请选择一个范围进行总结。
zh_hant: 未選擇任何文字。請選擇一個範圍進行總結。

# LlmNoSelectionTranslate
source: No text selected. Please select a range to translate.
ja_jp: 選択されたテキストがありません。翻訳する範囲を選択してください。
zh_hans: 未选择任何文本。请选择要翻译的范围。
zh_hant: 未選擇任何文字。請選擇要翻譯的範圍。

# LlmNoSelectionImprove
source: No text selected. Please select a range to improve.
ja_jp: 選択されたテキストがありません。改善する範囲を選択してください。
zh_hans: 未选择任何文本。请选择要改进的范围。
zh_hant: 未選擇任何文字。請選擇要改進的範圍。

# LlmNoSelectionCustom
source: No selection or file context. Please select text or add a file context.
ja_jp: 選択範囲またはファイルコンテキストがありません。テキストを選択するか、ファイルコンテキストを追加してください。
zh_hans: 没有选择或文件上下文。请选择文本或添加文件上下文。
zh_hant: 沒有選擇或文件上下文。請選擇文字或新增文件上下文。

# LlmEmptyCustomPrompt
source: Custom instruction input is empty.
ja_jp: カスタム指示の入力欄が空です。
zh_hans: 自定义指令输入为空。
zh_hant: 自訂指令輸入為空。

# LlmFileContextTitle
source: AI File Context
ja_jp: AI ファイルコンテキスト
zh_hans: AI 文件上下文
zh_hant: AI 檔案上下文

# LlmNoActiveTabForFileContext
source: No active tab to add as file context.
ja_jp: ファイルコンテキストとして追加するアクティブなタブがありません。
zh_hans: 没有活动选项卡可添加为文件上下文。
zh_hant: 沒有活動選項卡可新增為文件上下文。

# LlmPdfFileContextExcluded
source: PDF tabs are not included as file context.
ja_jp: PDF タブはファイルコンテキストに含まれません。
zh_hans: PDF 选项卡不包含在文件上下文中。
zh_hant: PDF 選項卡不包含在檔案上下文中。

# LlmInsertTitle
source: Insert AI Response
ja_jp: AI 応答入力
zh_hans: 插入人工智能响应
zh_hant: 插入人工智慧響應

# LlmNoOutputToInsert
source: No AI response to insert.
ja_jp: 入力するAIの応答がありません。
zh_hans: 没有可插入的 AI 响应。
zh_hant: 沒有可插入的 AI 響應。

# LlmActionExplain
source: Explain
ja_jp: 解説
zh_hans: 解释一下
zh_hant: 解釋一下

# LlmActionSummarize
source: Summarize
ja_jp: 要約
zh_hans: 总结
zh_hant: 總結

# LlmActionTranslate
source: Translate
ja_jp: 翻訳
zh_hans: 翻译
zh_hant: 翻譯

# LlmActionImprove
source: Improve
ja_jp: 改善
zh_hans: 改善
zh_hant: 改善

# LlmActionCustom
source: Custom Send
ja_jp: カスタム送信
zh_hans: 定制发送
zh_hant: 客製化發送

# LlmActionCustomPrompt
source: Custom Prompt
zh_hans: 自定义提示
zh_hant: 自訂提示

# LlmActionProgressFormat
source: [{0} in progress...]
ja_jp: [{0} 進行中...]
zh_hans: [{0} 进行中...]
zh_hant: [{0} 進行中...]

# LlmSummarizeComplete
source: {0} complete. Saved to {1}.
ja_jp: {0} 完了。{1} に保存しました。
zh_hans: {0} 完成。保存到 {1}。
zh_hant: {0} 完成。儲存到 {1}。

# LlmTranslateComplete
source: {0} complete. Saved to {1}.
ja_jp: {0} 完了。{1} に保存しました。
zh_hans: {0} 完成。保存到 {1}。
zh_hant: {0} 完成。儲存到 {1}。

# LlmTranslateResuming
source: {0} Continuing translation (from chunk {1}/{2})...
ja_jp: {0} 翻訳を続行中 (チャンク {1}/{2} から)...
zh_hans: {0} 继续翻译（来自块 {1}/{2}）...
zh_hant: {0} 繼續翻譯（來自區塊 {1}/{2}）...

# LlmTranslateCancelledWithSave
source: Operation cancelled. Translated content up to now has been saved: {0}
ja_jp: 操作が中断されました。現在までの翻訳内容が保存されました: {0}
zh_hans: 操作已取消。截至目前已保存翻译内容：{0}
zh_hant: 操作已取消。截至目前已儲存翻譯內容：{0}

# LlmChunkErrorFormat
source: Chunk {0} processing error: {1}
ja_jp: チャンク {0} 処理エラー: {1}
zh_hans: 块 {0} 处理错误：{1}
zh_hant: 區塊 {0} 處理錯誤：{1}

# LlmPreflightTitle
source: AI Pre-flight Check
ja_jp: AI送信前の確認 (Pre-flight Check)
zh_hans: 人工智能飞行前检查
zh_hant: 人工智慧飛行前檢查

# LlmPreflightContentFormat
source: Action: {0} AI Provider: {1} ({2}) Text Length: {3:N0} chars (approx. {4:N0} tokens) [Content Preview] {5} Please check for any sensitive information or unintended token usage before sending.
ja_jp: アクション: {0} 送信先AIプロバイダー: {1} ({2}) 送信テキストサイズ: {3:N0} 文字 (約 {4:N0} トークン消費) [送信内容のプレビュー] {5} セキュリティ上の問題や意図しないトークンの大量消費がないか確認してから送信してください。
zh_hans: 行动：{0} 人工智能提供商：{1} ({2}) 文本长度：{3:N0} 个字符（大约 {4:N0} 令牌） 【内容预览】 {5} 请在发送前检查是否有任何敏感信息或意外的令牌使用。
zh_hant: 行動：{0} 人工智慧提供者：{1} ({2}) 文字長度：{3:N0} 個字元（大約 {4:N0} 令牌） 【內容預覽】 {5} 請在發送前檢查是否有任何敏感資訊或意外的令牌使用。

# LlmPreflightApprove
source: Approve API Send
ja_jp: API送信を承認
zh_hans: 批准 API 发送
zh_hant: 批准 API 發送

# LlmPreflightCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# LlmRunningMessage
source: AI analysis and response generation is running asynchronously. Please wait...
ja_jp: AI分析および応答の生成が非同期で実行されています。しばらくお待ちください...
zh_hans: AI 分析和响应生成异步运行。请稍等...
zh_hant: AI 分析和回應生成非同步運行。請稍等...

# LlmExceptionFormat
source: An exception occurred during AI execution: {0}
ja_jp: AIの実行中に例外が発生しました: {0}
zh_hans: AI执行过程中出现异常：{0}
zh_hant: AI執行過程中出現異常：{0}

# LlmInstructionDefaultName
source: Instruction
ja_jp: 指示
zh_hans: 说明
zh_hant: 說明

# LlmAddInstructionTooltip
source: Add new custom instruction
ja_jp: 新しいカスタム指示を追加
zh_hans: 添加新的自定义指令
zh_hant: 新增自訂指令

# MoveTabLeftTooltip
source: Move to left tab (Ctrl/Shift + Click to move tab position)
ja_jp: 左のタブへ移動 (Ctrl/Shiftキーを押しながらクリックでタブ位置を変更)
zh_hans: 移至左侧选项卡（Ctrl/Shift + 单击可移动选项卡位置）
zh_hant: 移至左側選項卡（Ctrl/Shift + 點選可移動選項卡位置）

# MoveTabRightTooltip
source: Move to right tab (Ctrl/Shift + Click to move tab position)
ja_jp: 右のタブへ移動 (Ctrl/Shiftキーを押しながらクリックでタブ位置を変更)
zh_hans: 移至右侧选项卡（Ctrl/Shift + 单击可移动选项卡位置）
zh_hant: 移至右側選項卡（Ctrl/Shift + 點選可移動選項卡位置）

# SettingsAbout
source: About
ja_jp: 情報
zh_hans: 关于
zh_hant: 關於

# SettingsAboutDescription
source: A powerful and lightweight text & markdown editor. Supports live preview, code & formula templates, terminal interface, Git integration, and AI Assistant / Agent.
ja_jp: 強力で軽量なテキスト＆Markdownエディタです。 リアルタイムプレビュー、コードと数式のテンプレート、ターミナル、Git、AIアシスタント/エーゼットなどの機能を備えています。
zh_hans: 一个强大且轻量级的文本和 Markdown 编辑器。 支持实时预览、代码和公式模板、终端界面、Git 集成和 AI Assistant / Agent。
zh_hant: 一個強大且輕量級的文字和 Markdown 編輯器。 支援即時預覽、程式碼和公式模板、終端介面、Git 整合和 AI Assistant / Agent。

# SettingsAboutProjectGitHub
source: Project GitHub
zh_hans: 项目 GitHub
zh_hant: 專案 GitHub

# SettingsAboutThirdPartyNotices
source: Open Source Licenses (Third-Party Notices)
ja_jp: オープンソース ライセンス通知 (Third-Party Notices)
zh_hans: 开源许可证（第三方声明）
zh_hant: 開源許可證（第三方聲明）

# SettingsPreviewFontFamily
source: Preview Font Family
ja_jp: プレビューフォント
zh_hans: 预览字体
zh_hant: 預覽字型

# SettingsPreviewUseCustomBg
source: Use Custom Preview Background Color
ja_jp: カスタムプレビュー背景色を使用
zh_hans: 使用自定义预览背景色
zh_hant: 使用自訂預覽背景色

# SettingsPreviewUseCustomFg
source: Use Custom Preview Foreground Color
ja_jp: カスタムプレビュー文字色を使用
zh_hans: 使用自定义预览前景色
zh_hant: 使用自訂預覽前景色

# SettingsPreviewFontSize
source: Preview Font Size
ja_jp: プレビューフォントサイズ
zh_hans: 预览字号
zh_hant: 預覽字級

# SettingsShortcuts
source: Shortcuts
ja_jp: ショートカット
zh_hans: 快捷键
zh_hant: 快速鍵

# SettingsShortcutsHeaderKey
source: Shortcut
ja_jp: ショートカット
zh_hans: 快捷方式
zh_hant: 快速方式

# SettingsShortcutsHeaderDesc
source: Description
ja_jp: 説明
zh_hans: 描述
zh_hant: 描述

# ShortcutDescNewTab
source: New Tab
ja_jp: 新規タブ
zh_hans: 新 Tab
zh_hant: 新 Tab

# ShortcutDescSave
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# ShortcutDescOpen
source: Open File
ja_jp: ファイルを開く
zh_hans: 打开文件
zh_hant: 開啟文件

# ShortcutDescFind
source: Find
ja_jp: 検索
zh_hans: 查找
zh_hant: 尋找

# ShortcutDescClose
source: Close Tab
ja_jp: タブを閉じる
zh_hans: 关闭 Tab
zh_hant: 關閉 Tab

# ShortcutDescPrint
source: Print
ja_jp: 印刷
zh_hans: 打印
zh_hant: 列印

# ShortcutDescLeftPanel
source: Toggle Left Panel
ja_jp: 左パネル切り替え
zh_hans: 切换左侧面板
zh_hant: 切換左側面板

# ShortcutDescRightPanel
source: Toggle Right Panel
ja_jp: 右パネル切り替え
zh_hans: 切换右侧面板
zh_hant: 切換右側面板

# ShortcutDescTerminal
source: Toggle Terminal
ja_jp: ターミナル切り替え
zh_hans: 切换终端
zh_hant: 切換終端

# ShortcutDescUndo
source: Undo
ja_jp: 元に戻す
zh_hans: 撤消
zh_hant: 撤銷

# ShortcutDescRedo
source: Redo
ja_jp: やり直し
zh_hans: 重做
zh_hant: 重做

# ShortcutDescCopy
source: Copy
ja_jp: コピー
zh_hans: 复制
zh_hant: 複製

# ShortcutDescPaste
source: Paste
ja_jp: 貼り付け
zh_hans: 粘贴
zh_hant: 貼上

# ShortcutDescCut
source: Cut
ja_jp: 切り取り
zh_hans: 切
zh_hant: 切

# ShortcutDescAiPrompt
source: Send AI Prompt
ja_jp: AIプロンプト送信
zh_hans: 发送 AI 提示
zh_hant: 發送 AI 提示

# ShortcutDescSaveAs
source: Save As
ja_jp: 名前を付けて保存
zh_hans: 另存为
zh_hant: 另存為

# ShortcutDescTopMost
source: Always on Top
ja_jp: 最前面表示
zh_hans: 永远在最前面
zh_hant: 永遠在最前面

# ShortcutDescTheme
source: Toggle Theme
ja_jp: テーマ切り替え
zh_hans: 切换主题
zh_hant: 切換主題

# ShortcutDescStickyNote
source: Sticky Note
ja_jp: 付箋
zh_hans: 便利贴
zh_hant: 便利貼

# ShortcutDescLivePreview
source: Toggle Live Preview
ja_jp: ライブプレビュー切り替え
zh_hans: 切换实时预览
zh_hant: 切換即時預覽

# ShortcutDescWordWrap
source: Toggle Word Wrap
zh_hant: 切換自動換行

# ShortcutDescExpandRightPanel
source: Expand Right Panel
ja_jp: 右パネルの拡大
zh_hans: 展开右侧面板
zh_hant: 展開右側面板

# ShortcutDescMaximize
source: Toggle Maximize Window
ja_jp: ウィンドウ最大化の切り替え
zh_hans: 切换最大化窗口
zh_hant: 切換最大化視窗

# EditorFindPlaceholder
source: Find
ja_jp: 検索
zh_hans: 查找
zh_hant: 尋找

# EditorReplacePlaceholder
source: Replace
ja_jp: 置換
zh_hans: 更换
zh_hant: 更換

# EditorReplaceButton
source: Replace
ja_jp: 置換
zh_hans: 更换
zh_hant: 更換

# EditorReplaceAllButton
source: Replace All
ja_jp: すべて置換
zh_hans: 全部替换
zh_hant: 全部替換

# EditorFindClearTooltip
source: Clear
ja_jp: クリア
zh_hans: 清除
zh_hant: 清除

# EditorFindMatchCaseTooltip
source: Match Case (Aa)
ja_jp: 大文字小文字を区別 (Aa)
zh_hans: 火柴盒 (Aa)
zh_hant: 火柴盒 (Aa)

# EditorFindRegexTooltip
source: Use Regular Expression (.*)
ja_jp: 正規表現を使用 (.*)
zh_hans: 使用正则表达式 (.*)
zh_hant: 使用正規表示式 (.*)

# EditorReplaceClearTooltip
source: Clear
ja_jp: クリア
zh_hans: 清除
zh_hant: 清除

# EditorFindPrevTooltip
source: Previous
ja_jp: 前へ
zh_hans: 上一页
zh_hant: 上一頁

# EditorFindNextTooltip
source: Next
ja_jp: 次へ
zh_hans: 下一步
zh_hant: 下一步

# EditorFindCloseTooltip
source: Close
ja_jp: 閉じる
zh_hans: 关闭
zh_hant: 關閉

# EditorLoadingText
source: Loading...
ja_jp: 読み込み中...
zh_hans: 加载中...
zh_hant: 加載中...

# EditorLongLineProtectionFormat
source: ... too long ({0} characters total)
ja_jp: 長い行: {0} 文字, レンダリング保護
zh_hans: ... 内容过长（共 {0} 个字符）
zh_hant: ... 內容過長（共 {0} 個字元）

# StatusTotalLinesFormat
source: Total Lines: {0}
ja_jp: 総行数: {0}
zh_hans: 总行数：{0}
zh_hant: 總行數：{0}

# StatusSelectionStatsFormat
source: Selected: {0} chars / {1} tokens / {2} words / {3} lines
ja_jp: 選択済: {0}文字 / {1}トークン / {2}単語 / {3}行
zh_hans: 选定：{0} 字符 / {1} 标记 / {2} 字 / {3} 行
zh_hant: 選定：{0} 字元 / {1} 標記 / {2} 字 / {3} 行

# UnsavedChangesAppCloseTitle
source: Unsaved Changes
ja_jp: 保存されていない変更
zh_hans: 未保存的更改
zh_hant: 未儲存的更改

# UnsavedChangesAppCloseMessage
source: There are {0} unsaved tabs. Save before exiting?
ja_jp: 保存されていないタブが {0} 個あります。終了する前に保存しますか？
zh_hans: 有 {0} 未保存的选项卡。退出前保存吗？
zh_hant: 有 {0} 未儲存的選項卡。退出前保存嗎？

# UnsavedChangesAppCloseDiscard
source: Exit without saving
ja_jp: 保存せずに終了
zh_hans: 退出而不保存
zh_hant: 退出而不保存

# UnsavedChangesAppCloseSave
source: Save and exit
ja_jp: 保存して終了
zh_hans: 保存并退出
zh_hant: 儲存並退出

# UnsavedChangesTabCloseTitle
source: Save Changes
ja_jp: 変更の保存
zh_hans: 保存更改
zh_hant: 儲存變更

# UnsavedChangesTabCloseMessage
source: Changes to '{0}' are unsaved. Do you want to close it?
ja_jp: ファイル '{0}' の変更は保存されていません。閉じますか？
zh_hans: 对“{0}”的更改未保存。您想关闭它吗？
zh_hant: 對“{0}”的更改未儲存。您想關閉它嗎？

# UnsavedChangesTabCloseDiscard
source: Close without saving
ja_jp: 保存せずに閉じる
zh_hans: 关闭而不保存
zh_hant: 關閉而不儲存

# UnsavedChangesTabCloseSave
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存
